# coding:utf-8

# ====================== 必填项 ======================
# 账号
ACCOUNT = 'user'

# 密码
PASSWORD = 'password'

# 出发站
FROM_STATION = '上海'

# 到达站
TO_STATION = '武汉'

# 出发时间,例如: 2020-09-15.
DATE = '2020-01-25'

# 乘车人 (12306账号必须添加下列乘客信息)
USER = ['xxx']

# 车次(车次首字母大写)
TRAINS_NO = ['K1156', '3216', 'K4138', '3256', 'K282']

# 座位类别: 商务座(9),一等座(8),二等座(7),高级软卧(6),软卧(5),动卧(4),硬卧(3),软座(2),硬座(1),无座(0)
SEAT_TYPE = [3, 1]

# ====================== 非必填项 ======================

# 验证码识别方式（0：自动，1：手动）
CAPTCHA_IDENTIFY = 0

# 开售时间(24小时制)15:30:00
SELL_TIME = ''

# 通知手机号（暂不可用）
PHONE = '159xxx00xxx'

# 是否使用代理（暂不可用）
USE_PROXY = False
