# coding:utf-8

# ====================== 必填项 ======================
# 账号
ACCOUNT = "wealip"

# 密码
PASSWORD = "Rl1230690"

# 出发站
FROM_STATION = "广州"

# 到达站
TO_STATION = "武汉"

# 出发时间,例如: 2019-10-15
DATE = "2019-10-15"

# 乘车人身份证号码
ID_CARD = ['400100xxxx12120000']

# ====================== 非必填项 ======================

# 车次
TRAINS_NO = ['Z100', 'G100']

# 座位类别: 商务座(9),特等座(P),一等座(M),二等座(O),高级软卧(6),软卧(4),硬卧(3),软座(2),硬座(1),无座(1)
SEAT_TYPE_CODE = ['3']

# 购票人类别: 成人票:1,儿童票:2,学生票:3,残军票:4
PASSENGER_TYPE_CODE = '1'

# 通知手机号
PHONE = ""
